# Lecture 19 - SQL Joins

Tuesday 2022/03/29

---

## ‚ú® Joining Tables

Today, we will review basic SQL joins.

‚ñ∂Ô∏è First, run the code cell below to import modules used for **üß≠ Check Your Work** sections and the autograder.

In [1]:
import unittest
import base64
tc = unittest.TestCase()

---

### üéØ Pre-exercise: Import Packages

#### üëá Tasks

- ‚úîÔ∏è Import the following Python packages.
    1. `pandas`: Use alias `pd`.
    2. `numpy`: Use alias `np`.
    3. `sqlite3`: No alias

In [2]:
### BEGIN SOLUTION
import pandas as pd
import numpy as np
import sqlite3
### END SOLUTION

#### üß≠ Check your work

In [3]:
import sys
tc.assertTrue('pd' in globals(), 'Check whether you have correctly imported Pandas with an alias.')
tc.assertTrue('np' in globals(), 'Check whether you have correctly imported NumPy with an alias.')
tc.assertTrue('sqlite3' in globals(), 'Check whether you have correctly imported the sqlite3 package.')

---
### üìå Read Sqlite Database File

‚ñ∂Ô∏è Run the code below to select the first 5 rows from the `students`, `courses`, and `enrollments` tables.

In [4]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('course-enrollments-sample.db')

print('students table')
display(pd.read_sql_query('SELECT * FROM students LIMIT 5;', con=conn))

print('========================')

print('courses table')
display(pd.read_sql_query('SELECT * FROM courses LIMIT 5;', con=conn))

print('========================')

print('enrollments table')
display(pd.read_sql_query('SELECT * FROM enrollments LIMIT 5;', con=conn))

print('========================')

conn.close()

students table

   student_id first_name   last_name        major      class
0       69540      Megan  Cunningham      History  Sophomore
1       60083      Wendy       House   Statistics     Senior
2       65353    Anthony        Hill    Sociology   Freshman
3       65070    Kenneth      Hayden  Accountancy     Junior
4       63215     Willie    Anderson      History   Freshman

========================
courses table

  course_id                       course_name  credit_hours
0  ATMS 120      Severe and Hazardous Weather             3
1    CS 125  Introduction to Computer Science             4
2  PHYS 140                   How Things Work             4
3  CLCV 115      Mythology of Greece and Rome             3
4  ASTR 122                Stars and Galaxies             2

========================
enrollments table

   student_id course_id
0       63438  ASTR 122
1       76342    CS 125
2       64798  PHYS 140
3       64932  ECON 101
4       60489  PHYS 140

========================

#### üß≠ Check your work

In [5]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn_checker = sqlite3.connect('course-enrollments-sample.db')
tables_to_check = ['students', 'courses', 'enrollments']

# Check if table exists
user_tables = list(pd.read_sql_query('SELECT * FROM sqlite_master WHERE type="table";', con=conn_checker)['tbl_name'])

for table_to_check in tables_to_check:
    tc.assertTrue(table_to_check in user_tables, f'{table_to_check} does not exist in your NWT.db file!')

conn_checker.close()

---

### üéØ Exercise 1: Join `students` into `enrollments` table

#### üëá Tasks

- ‚úîÔ∏è Write a query that joins the `students` table into `enrollments`.
- ‚úîÔ∏è Select all columns.
- ‚úîÔ∏è Store your query to a new variable named `query_joined1`.

In [6]:
### BEGIN SOLUTION
query_joined1 = '''
SELECT *
FROM enrollments
LEFT JOIN students
ON enrollments.student_id == students.student_id;
'''
### END SOLUTION

conn = sqlite3.connect('course-enrollments-sample.db')
df_result = pd.read_sql_query(query_joined1, con=conn)
display(df_result)
conn.close()

,student_id,course_id,student_id,first_name,last_name,major,class
0,63438,ASTR 122,63438,Kaitlyn,Butler,Computer Science,Senior
1,76342,CS 125,76342,Joanna,Jackson,Sociology,Junior
2,64798,PHYS 140,64798,Monica,Reilly,History,Sophomore
3,64932,ECON 101,64932,Noah,Nguyen,Sociology,Freshman
4,60489,PHYS 140,60489,Jennifer,Williamson,Computer Science,Sophomore
...,...,...,...,...,...,...,...
197,74780,ATMS 120,74780,Justin,Patton,History,Freshman
198,72793,IB 105,72793,Brian,Smith,Accountancy,Freshman
199,66953,CS 125,66953,Rose,Shea,Economics,Sophomore
200,74413,PHYS 140,74413,Bethany,Howard,Psychology,Senior
201,76695,ECON 101,76695,Megan,Foster,History,Junior

#### üß≠ Check your work

In [7]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('course-enrollments-sample.db')
df_check = pd.read_sql_query(query_joined1, con=conn)
tc.assertEqual(df_result.shape, (202, 7), 'Incorrect number of rows and/or columns')
conn.close()

---

### üéØ Exercise 2: Join all three tables

#### üëá Tasks

- ‚úîÔ∏è Write a query that joins all three tables.
- ‚úîÔ∏è Select all columns.
- ‚úîÔ∏è Store your query to a new variable named `query_joined2`.

In [8]:
### BEGIN SOLUTION
query_joined2 = '''
SELECT *
FROM enrollments
LEFT JOIN students
ON enrollments.student_id == students.student_id
LEFT JOIN courses
ON enrollments.course_id == courses.course_id;
'''
### END SOLUTION

conn = sqlite3.connect('course-enrollments-sample.db')
df_result = pd.read_sql_query(query_joined2, con=conn)
display(df_result)
conn.close()

,student_id,course_id,student_id,first_name,last_name,major,class,course_id,course_name,credit_hours
0,63438,ASTR 122,63438,Kaitlyn,Butler,Computer Science,Senior,ASTR 122,Stars and Galaxies,2
1,76342,CS 125,76342,Joanna,Jackson,Sociology,Junior,CS 125,Introduction to Computer Science,4
2,64798,PHYS 140,64798,Monica,Reilly,History,Sophomore,PHYS 140,How Things Work,4
3,64932,ECON 101,64932,Noah,Nguyen,Sociology,Freshman,ECON 101,Introduction to Economics,4
4,60489,PHYS 140,60489,Jennifer,Williamson,Computer Science,Sophomore,PHYS 140,How Things Work,4
...,...,...,...,...,...,...,...,...,...,...
197,74780,ATMS 120,74780,Justin,Patton,History,Freshman,ATMS 120,Severe and Hazardous Weather,3
198,72793,IB 105,72793,Brian,Smith,Accountancy,Freshman,IB 105,Environmental Biology,4
199,66953,CS 125,66953,Rose,Shea,Economics,Sophomore,CS 125,Introduction to Computer Science,4
200,74413,PHYS 140,74413,Bethany,Howard,Psychology,Senior,PHYS 140,How Things Work,4
201,76695,ECON 101,76695,Megan,Foster,History,Junior,ECON 101,Introduction to Economics,4

#### üß≠ Check your work

In [9]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('course-enrollments-sample.db')
df_check = pd.read_sql_query(query_joined2, con=conn)
tc.assertEqual(df_result.shape[0], 202, 'Incorrect number of rows')
conn.close()

---

### üéØ Exercise 3: Total number of credit hours by class standing

#### üëá Tasks

- ‚úîÔ∏è Write a query that finds the total number of credit hours by class status (freshman, sophomore, junior, senior).
- ‚úîÔ∏è Store your query to a new variable named `query_joined3`.

#### üîë Expected Output

|    | class     |   SUM(credit_hours) |
|---:|:----------|--------------------:|
|  0 | Freshman  |                 198 |
|  1 | Junior    |                 137 |
|  2 | Senior    |                 128 |
|  3 | Sophomore |                 199 |

In [10]:
### BEGIN SOLUTION
query_joined3 = '''
SELECT class, SUM(credit_hours)
FROM enrollments
LEFT JOIN students
ON enrollments.student_id == students.student_id
LEFT JOIN courses
ON enrollments.course_id == courses.course_id
GROUP BY class;
'''
### END SOLUTION

conn = sqlite3.connect('course-enrollments-sample.db')
df_result = pd.read_sql_query(query_joined3, con=conn)
display(df_result)
conn.close()

       class  SUM(credit_hours)
0   Freshman                198
1     Junior                137
2     Senior                128
3  Sophomore                199

#### üß≠ Check your work

In [11]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('course-enrollments-sample.db')
df_check = pd.read_sql_query(query_joined3, con=conn)

df_check.columns = ['A', 'B']
df_correct = pd.DataFrame({'A': ['Freshman', 'Junior', 'Senior', 'Sophomore'],
 'B': [198, 137, 128, 199]})

pd.testing.assert_frame_equal(df_check, df_correct)

conn.close()